# Вправа по програмуванню 4-3
# Аналіз бюджету

# Ініціалізація накопичувальної змінної.
total = 0

# Отримання суми місячного бюджету від користувача.
budget = float(input("Введіть суму бюджету на місяць: "))

# Отримання суми окремих статей витрат від користувача.
spent = 1
i = 1

print("\nВведіть суму витрат або 0, якщо витрат немає:")

while spent != 0:
    print(f"{i} стаття витрат: ", end="")
    spent = float(input())
    total += spent
    i += 1

# Виводимо результати на екран.
print(f"\nВаш місячний бюджет становить {budget:,.2f} грн.")
print(f"Ваші місячні витрати становлять {total:,.2f} грн.")

if budget > total:
    print(f"В цьому місяці Ви витратили на {budget - total:,.2f} " +
          f"грн менше за суму Вашого бюджету. Так тримати!")
elif budget < total:
    print(f"В цьому місяці Ви витратили на {total - budget:,.2f} " +
          f"грн більше за суму Вашого бюджету. Плануйте краще!")
else:
    print("Витрати відповідають Вашому бюджету. Так тримати!")
