# Вправа по програмуванню 4-7
# Дрібна монета для заробітної плати

# Ініціалізація накопичувальної змінної.
total = 0

# Отримання кількості робочих днів.
days = int(input("Кількість робочих днів: "))

# Розраховуємо і виводимо результати на екран.
print("День\t\tЗарплата")
print("------------------------")

salary_per_day = 1

for day in range(1, days + 1):
    print(day, "\t\t", salary_per_day / 100)
    total += salary_per_day
    salary_per_day *= 2

print(f"\nЗагальна заробітна плата за {days} робочих днів "
      f"становить {total / 100:,.2f} грн.")
