# Вправа по програмуванню 5-19
# Майбутня сума на рахунку


# Головна функція.
def main():
    # Отримання поточної суми на рахунку.
    current_amount = float(input("Поточна сума на рахунку: "))

    # Отримання місячної відсоткової ставки.
    rate = float(input("Місячна відсоткова ставка: "))

    # Отримання терміну вкладу в місяцях.
    time = int(input("Термін вкладу в місяцях: "))

    # Розрахунок майбутньої суми на рахунку після вказаного періоду часу.
    future_amount = calculate_future_amount(current_amount, rate, time)

    # Виводимо на екран результати розрахунків.
    print(f"По закінченню періоду кінцева сума на рахунку "
          f"становитиме {future_amount:,.2f}")


# Функція розраховує і повертає майбутню суму на рахунку
# після вказаного періоду часу.
def calculate_future_amount(current_amount, rate, time):
    if rate > 1:
        rate /= 100
    return current_amount * (1 + rate) ** time


# Виклик головної функції.
main()
