# Вправа по програмуванню 5-1
# Конвертер кілометрів у милі

# Іменовані константи.
KILOMETERS_TO_MILES = 0.6214


# Визначення головної функції.
def main():
    # Отримання відстані в кілометрах.
    kilometers = float(input("Введіть відстань в кілометрах: "))

    # Конвертуємо кілометри у милі.
    miles = convert_km_to_mi(kilometers)

    # Виводимо результати на екран.
    print(f"{kilometers:.1f} кілометрів дорівнює {miles:.1f} милям.")


# Функція приймає кілометри в якості аргумента
# і повертає еквівалентне значення в милях.
def convert_km_to_mi(kilometers):
    return kilometers * KILOMETERS_TO_MILES


# Викликати головну функцію
main()
