# Вправа по програмуванню 2-14
# Обчислення складного відсотка

# Отримання суми вкладу.
p = float(input("Сума вкладу: "))

# Отримання річної відсоткової ставки.
r = float(input("Річна відсоткова ставка: "))

# Отримання кількості нарахувань відсоткового прибутку в рік.
n = int(input("Кількість нарахувань прибутку в рік: "))

# Отримання терміну вкладу в роках.
t = int(input("Термін вкладу в роках: "))

# Коригування відсоткової ставки.
r = r / 100

# Розрахунок суми прибутку.
a = p * (1 + r / n) ** (n * t)

# Виводимо на екран результати розрахунків.
print(f"По закінченню періоду кінцева сума на рахунку становитиме {a:,.2f}")
