# Вправа по програмуванню 2-4
# Загальний обсяг продажів

# Відсоток податку з продажів.
TAX_RATE = 0.07

# Отримання ціни для кожної позиції товару.
item1 = float(input("Введіть ціну товару #1: "))
item2 = float(input("Введіть ціну товару #2: "))
item3 = float(input("Введіть ціну товару #3: "))
item4 = float(input("Введіть ціну товару #4: "))
item5 = float(input("Введіть ціну товару #5: "))

# Розрахунок вартості товарів.
subtotal = item1 + item2 + item3 + item4 + item5

# Розрахунок податку з продажів товарів.
tax = subtotal * TAX_RATE

# Розрахунок загальної вартості товарів.
total = subtotal + tax

# Виводимо на екран вартість товарів, податок з продажів
# і загальну вартість товарів.
print(f"\nВартість товарів: {subtotal:,.2f}")
print(f"Податок з продажів: {tax:,.2f}")
print(f"Загальна вартість товарів: {total:,.2f}")
