# Вправа по програмуванню 2_8
# Чайові, податок та загальна сума

# Константи для ставки податку та ставки чайових.
TAX_RATE = 0.07
TIP_RATE = 0.18

# Отримання вартості їжі.
food = float(input("Вартість їжі: "))

# Розрахунок чайових.
tip = food * TIP_RATE

# Розрахунок податку.
tax = food * TAX_RATE

# Розрахунок загальної вартості.
total = food + tip + tax

# Виводимо на екран результати розрахунків.
print(f"Розмір чайових: {tip:.2f}")
print(f"Податок з продажу: {tax:.2f}")
print(f"Загальна вартість: {total:.2f}")
