# Вправа по програмуванню 2-13
# Вирощування винограду

# Отримання довжини гряди в метрах.
r = float(input("Довжина гряди в метрах: "))

# Отримання розміру простору, який займає кінцева опора в метрах.
e = float(input("Розмір простору, який займає кінцева опора в метрах: "))

# Отримання відстані між виноградними лозами в метрах.
s = float(input("Відстань між виноградними лозами в метрах: "))

# Розрахунок кількості виноградних лоз.
v = (r - 2 * e) / s

# Виводимо на екран результати розрахунків.
print(f"У вас достатньо місця для посадки {v:.0f} виноградних лоз")
