# Вправа по програмуванню 2-7
# Витрати палива автомобіля

# Отримання кількості кілометрів, які проїхав автомобіль.
kilometers = float(input("Кількість кілометрів, які проїхав автомобіль: "))

# Отримання кількості літрів, які були спожиті автомобілем.
litres = float(input("Кількість палива, яке було спожито автомобілем: "))

# Розрахунок витрати палива автомобілем.
kilometers_per_litre = litres / kilometers * 100

# Виводимо на екран результати розрахунків.
print(f"Витрати палива автомобіля складає " +
      f"{kilometers_per_litre:.2f} літрів на кілометр.")
