# Вправа по програмуванню 2-11
# Статистика по статі учнів

# Отримання кількості учнів чоловічої статі.
boys = int(input("Кількість учнів чоловічої статі: "))

# Отримання кількості учнів жіночої статі.
girls = int(input("Кількість учнів жіночої статі: "))

# Розрахунок загальної кількості учнів.
total = boys + girls

# Розрахунок відсотка учнів чоловічої статі.
boys_percent = boys / total * 100

# Розрахунок відсотка учнів жіночої статі.
girls_percent = girls / total * 100

# Виводимо на екран результати розрахунків.
print(f"Відсоток учнів чоловічої статі становить {boys_percent:.1f} %")
print(f"Відсоток учнів жіночої статі становить {girls_percent:.1f} %")
