# Вправа по програмуванню 7-4
# Програма аналізу чисел


# Головна функція.
def main():
    # Ініціалізація списку.
    numbers = [0] * 20

    # Отримання чисел і присвоєння їх елементам списку.
    for i in range(20):
        numbers[i] = int(input(f"Введіть {i+1} число: "))

    # Визначення найменшого числа.
    smallest = min(numbers)

    # Визначення найбільшого числа.
    largest = max(numbers)

    # Визначення суми чисел.
    total = sum(numbers)

    # Розрахунок середнього арифметичного значення.
    average = total / 20

    # Виводимо результати на екран.
    print(f"\nНайменше число: {smallest}")
    print(f"Найбільше число: {largest}")
    print(f"Сума чисел у списку: {total:.2f}")
    print(f"Середнє арифметичне значення: {average:.2f}")


# Виклик головної функції.
main()
