# Вправа по програмуванню 7-1
# Загальний обсяг продажів

# Іменовані константи.
DAYS = 7


# Головна функція.
def main():
    # Ініціалізація накопичувальної змінної.
    total = 0

    # Ініціалізація списку.
    sales = [0] * DAYS

    # Отримання щоденної суми продажу та розрахунок загального обсягу продажів.
    for i in range(DAYS):
        sales[i] = float(input(f"Продаж за {i+1} день: "))
        total += sales[i]

    # Виводимо результати на екран.
    print(f"\nЗагальний обсяг продажів: {total:.2f}")


# Виклик головної функції.
main()
