# Вправа по програмуванню 7-3
# Статистика дощових опадів


# Головна функція.
def main():
    # Ініціалізація списку.
    rainfall = [0] * 12

    # Ініціалізація списку з назвами місяців.
    months = ["січень", "лютий", "березень", "квітень",
              "травень", "червень", "липень", "серпень",
              "вересень", "жовтень", "листопад", "грудень"]

    # Отримання кількості опадів і присвоєння її елементам списку.
    for i in range(12):
        rainfall[i] = int(input(f"Кількість опадів за {months[i]}: "))

    # Визначення загальної кількості опадів за рік.
    total = sum(rainfall)

    # Розрахунок середньої щомісячної кількості опадів.
    average = total / 12

    # Визначення місяця з максимальною кількістю опадів.
    highest_rainfall = max(rainfall)
    month_highest_rainfall = rainfall.index(highest_rainfall)

    # Визначення місяця з мінімальною кількістю опадів.
    lowest_rainfall = min(rainfall)
    month_lowest_rainfall = rainfall.index(lowest_rainfall)

    # Виводимо результати на екран.
    print(f"\nЗагальна кількість опадів за рік: {total:.2f}")
    print(f"Середня щомісячна кількість опадів: {average:.2f}")
    print(f"Максимальна кількість опадів: {months[month_highest_rainfall]}")
    print(f"Мінімальна кількість опадів: {months[month_lowest_rainfall]}")


# Виклик головної функції.
main()
