# Вправа по програмуванню 6-5
# Сума чисел


# Головна функція.
def main():
    # Відкриття файлу для читання.
    infile = open(r"chapter_6\data\numbers.txt")

    # Ініціалізація накопичувальної змінної.
    total = 0

    # Читання файлу та підрахунок суми чисел.
    for line in infile:
        number = float(line)
        total += number

    # Виводимо результати на екран.
    print(f"Сума прочитаних із файлу чисел: {total}")

    # Закриття файлу.
    infile.close()


# Виклик головної функції.
main()
