# Вправа по програмуванню 3-10
# Підрахунок монет

# Іменовані константи.
COIN5_VALUE = 5
COIN10_VALUE = 10
COIN50_VALUE = 50

# Отримання кількості монет різних номіналів.
coin5 = int(input("Кількість монет номіналом 5 коп: "))
coin10 = int(input("Кількість монет номіналом 10 коп: "))
coin50 = int(input("Кількість монет номіналом 50 коп: "))

# Розрахунок загальної суми.
total = coin5 * COIN5_VALUE + coin10 * COIN10_VALUE + coin50 * COIN50_VALUE

# Виводимо результат на екран.
if total > 100:
    print(f"Нажаль, ви програли. Загальна сума більша за суму в 100 копійок.")
elif total < 100:
    print(f"Нажаль, ви програли. Загальна сума менша за суму в 100 копійок.")
else:
    print(f"Вітаємо, Ви перемогли! Загальна сума становить 100 копійок.")
