# Вправа по програмуванню 3-6
# Магічні дати

# Отримання числового значення для дня.
day = int(input("Введіть день у числовій формі: "))

# Отримання числового значення для місяця.
month = int(input("Введіть місяць у числовій формі: "))

# Отримання числового значення для року.
year = int(input("Введіть рік у числовій формі: "))

# Перевірка правильності введених даних.
if day < 1 or day > 31:
    print("Помилка! Був введений недопустимий день.")
elif month < 1 or month > 12:
    print("Помилка! Був введений недопустимий місяць.")
elif year < 0 or year > 99:
    print("Помилка! Був введений недопустимий рік.")

# Отримані дані перевірені і вони є допустимими.
else:
    # Розрахунок магічної дати.
    print(f"Введена дата: {day}/{month}/{year}")
    if (day * month) == year:
        print(f"Введена дата є магічною.")
    else:
        print(f"Введена дата не є магічною.")
