# Вправа по програмуванню 3-11
# Бонуси книжкового клубу

# Отримання кількості книг, куплених в цьому місяці.
books = int(input("Кількість книг, куплених в цьому місяці: "))

# Визначення кількості бонусів, що будуть нараховані.
if books < 2:
    points = 0
elif books < 4:
    points = 5
elif books < 6:
    points = 15
elif books < 8:
    points = 30
elif books >= 8:
    points = 60

# Виводимо результати на екран.
print(f"В цьому місяці Вами було куплено {books} книг, " +
      f"за що Ви отримуєте {points} бонусів.")
