# Вправа по програмуванню 3-16
# Визначення високосного року

# Отримання року для перевірки на високосність:
year = int(input("Введіть рік: "))

# Визначення високосності року.
if year % 100 == 0:
    if year % 400 == 0:
        leap_year = True
    else:
        leap_year = False
else:
    if year % 4 == 0:
        leap_year = True
    else:
        leap_year = False

# Виводимо результати на екран.
if leap_year:
    print(f"{year} рік є високосним, тому місяць лютий має 29 днів.")
else:
    print(f"{year} рік не є високосним, тому місяць лютий має 28 днів.")
