# Вправа по програмуванню 3-17
# Діагностичне дерево перевірки якості Wi-Fi

# Пошук причини поганого Wi-Fi і вирішення проблеми.
print("Перезапустіть комп'ютер і спробуйте підключитись знову!")
print("Чи вдалося вирішити проблему? ", end="")
answer = input()
if answer == "так":
    print("Радий був допомогти.")
else:
    print("\nПерезапустіть маршрутизатор і спробуйте підключитись знову!")
    print("Чи вдалося вирішити проблему? ", end="")
    answer = input()
    if answer == "так":
        print("Радий був допомогти.")
    else:
        print("\nПереконайтеся, що кабелі між маршрутизатором та модемом "
              "міцно під'єднані!")
        print("Чи вдалося вирішити проблему? ", end="")
        answer = input()
        if answer == "так":
            print("Радий був допомогти.")
        else:
            print("\nПеремістіть маршрутизатор у інше місце!")
            print("Чи вдалося вирішити проблему? ", end="")
            answer = input()
            if answer == "так":
                print("Радий був допомогти.")
            else:
                print("\nВізьміть новий маршрутизатор!")
