# Вправа по програмуванню 3-14
# Індекс маси тіла

# Отримання ваги користувача.
weight = float(input("Вага користувача в кг: "))

# Отримання зросту користувача.
height = float(input("Зріст користувача в м: "))

# Розрахунок індексу маси тіла.
imt = weight / (height * height)

# Виводимо результати на екран.
print(f"\nВаш індекс маси тіла становить {imt:.2f}")

if imt < 18.5:
    print(f"Ваша вага нижче за норму.")
elif imt < 25:
    print(f"Ваша вага є оптимальною.")
else:
    print(f"Ваша вага вище за норму.")
