# Вправа по програмуванню 3-7
# Мікшер для кольорів

# Іменовані константи.
RED = "червоний"
BLUE = "синій"
YELLOW = "жовтий"

# Отримання від користувача першого кольору.
color1 = input("Перший основний колір буквами в нижньому регістрі: ")

# Отримання від користувача другого кольору.
color2 = input("Другий основний колір буквами в нижньому регістрі: ")

# Перевірка правильності введення кольорів.
if color1 != RED and color1 != BLUE and color1 != YELLOW:
    print("Помилка! Був введений недопустимий колір.")
elif color2 != RED and color2 != BLUE and color2 != YELLOW:
    print("Помилка! Був введений недопустимий колір.")
elif color1 == color2:
    print("Помилка! Були введені однакові кольори.")

# Отримані дані перевірені і вони є допустимими.
else:
    # Визначимо вторинний колір, якщо перший колір червоний.
    if color1 == RED:
        if color2 == BLUE:
            print("Фіолетовий колір")
        else:  # Другий колір повинен бути жовтим.
            print("Помаранчевий колір")

    # Визначимо вторинний колір, якщо перший колір синій.
    elif color1 == BLUE:
        if color2 == YELLOW:
            print("Зелений колір")
        else:  # Другий колір повинен бути червоним.
            print("Фіолетовий колір")

    # Визначимо вторинний колір, якщо перший колір жовтий.
    elif color1 == YELLOW:
        if color2 == RED:
            print("Помаранчевий колір")
        else:  # Другий колір повинен бути синім.
            print("Зелений колір")
