# Вправа по програмуванню 3-9
# Кольори колеса рулетки

# Отримання числа.
num = int(input("Введіть число від 0 до 36: "))

# Перевірка правильності введених даних.
if num < 0 or num > 36:
    print("Помилка! Було введено недопустиме значення.")

# Отримані дані перевірені і вони є допустимими.
# Виводимо результат на екран.
else:
    if num == 0:
        print("Колір карману - зелений.")
    elif num >= 1 and num <= 10:
        if num % 2 == 0:
            print("Колір карману - чорний.")
        else:
            print("Колір карману - червоний.")
    elif num >= 11 and num <= 18:
        if num % 2 == 0:
            print("Колір карману - червоний.")
        else:
            print("Колір карману - чорний.")
    elif num >= 19 and num <= 28:
        if num % 2 == 0:
            print("Колір карману - чорний.")
        else:
            print("Колір карману - червоний.")
    elif num >= 29 and num <= 36:
        if num % 2 == 0:
            print("Колір карману - червоний.")
        else:
            print("Колір карману - чорний.")
